app/views/artists/index.html.erb

    Songs:
    <ul><% artist.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]