app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.present?
        @songs = Song.where(artist: @artist.id )
        if @songs.blank?
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      @song = Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]